ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_smvw00_1.h
#define ESPI_SMVW00_1_SMVW02_DW1_RESETVALUE (0x10101U)                                    /**<  (ESPI_SMVW00_1_SMVW02_DW1) Slave-to-Master Virtual Wire 2 Register (DWord 1)  Reset Value */

#define ESPI_SMVW00_1_SMVW02_DW1_SRC0_Pos     (0)                                            /**< (ESPI_SMVW00_1_SMVW02_DW1) Slave-to-Master data for Bit Position 0 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. Position */
#define ESPI_SMVW00_1_SMVW02_DW1_SRC0_Msk     (0x1U << ESPI_SMVW00_1_SMVW02_DW1_SRC0_Pos)    /**< (ESPI_SMVW00_1_SMVW02_DW1) Slave-to-Master data for Bit Position 0 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. Mask */
#define ESPI_SMVW00_1_SMVW02_DW1_SRC1_Pos     (8)                                            /**< (ESPI_SMVW00_1_SMVW02_DW1) Slave-to-Master data for Bit Position 1 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. Position */
#define ESPI_SMVW00_1_SMVW02_DW1_SRC1_Msk     (0x1U << ESPI_SMVW00_1_SMVW02_DW1_SRC1_Pos)    /**< (ESPI_SMVW00_1_SMVW02_DW1) Slave-to-Master data for Bit Position 1 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. Mask */
#define ESPI_SMVW00_1_SMVW02_DW1_SRC2_Pos     (16)                                           /**< (ESPI_SMVW00_1_SMVW02_DW1) Slave-to-Master data for Bit Position 2 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. Position */
#define ESPI_SMVW00_1_SMVW02_DW1_SRC2_Msk     (0x1U << ESPI_SMVW00_1_SMVW02_DW1_SRC2_Pos)    /**< (ESPI_SMVW00_1_SMVW02_DW1) Slave-to-Master data for Bit Position 2 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. Mask */
#define ESPI_SMVW00_1_SMVW02_DW1_SRC3_Pos     (24)                                           /**< (ESPI_SMVW00_1_SMVW02_DW1) Slave-to-Master data for Bit Position 3 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. Position */
#define ESPI_SMVW00_1_SMVW02_DW1_SRC3_Msk     (0x1U << ESPI_SMVW00_1_SMVW02_DW1_SRC3_Pos)    /**< (ESPI_SMVW00_1_SMVW02_DW1) Slave-to-Master data for Bit Position 3 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. Mask */
#define ESPI_SMVW00_1_SMVW02_DW1_Msk          (0x01010101UL)                                 /**< (ESPI_SMVW00_1_SMVW02_DW1) Register Mask  */
#define ESPI_SMVW00_1_SMVW02_DW1_SRC_Pos      (0)                                            /**< (ESPI_SMVW00_1_SMVW02_DW1 Position) Slave-to-Master data for Bit Position 3 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. */
#define ESPI_SMVW00_1_SMVW02_DW1_SRC_Msk      (0xFU << ESPI_SMVW00_1_SMVW02_DW1_SRC_Pos)     /**< (ESPI_SMVW00_1_SMVW02_DW1 Mask) SRC */
#define ESPI_SMVW00_1_SMVW02_DW1_SRC(value)   (ESPI_SMVW00_1_SMVW02_DW1_SRC_Msk & ((value) << ESPI_SMVW00_1_SMVW02_DW1_SRC_Pos))

/* -------- ESPI_SMVW00_1_SMVW03_DW0 : (ESPI_SMVW00_1 Offset: 0x18) (R/W 32) Slave-to-Master Virtual Wire 3 Register (DWord 0) -------- */

typedef union
{
  struct
  {
    uint32_t INDEX:8;                   /**< bit:   0..7  The Index for SRC0, SRC1, SRC2 and SRC3. A write to this register that changes the value of any one or more of SRC0, SRC1,\n      SRC2 or SRC3 will generate a Slave-to-Master Virtual Wire transaction with this index. Setting the INDEX field to 0 disables the register\n      from generating any Virtual Wire traffic to the Master. Setting the INDEX field to 1 is illegal, since INDEX=1 is reserved for Serial IRQ. */
    uint32_t STOM_SRC:2;                /**< bit:   8..9  This field determines which reset signal in addition to RESET_SYS resets SRC[3:0] in this register:\n      3=PLTRST\n      2=RESET_SIO\n      1=RESET_SYS. This is the only reset signal that will reset the SRC fields.\n      0=RESET_ESPI. */
    uint32_t :2;                        /**< bit: 10..11  Reserved                                      */
    uint32_t STOM_R_STATE:4;            /**< bit: 12..15  The four bits in this field are loaded into SRC0, SRC1, SRC2 and SRC3 when the reset signal selected by S2M RESET SRC is\n      asserted. If STOM_SRC is set for RESET_SYS, the SRC bits are set to the default value of this field, rather than its programmed value,\n      since this field is also reset on RESET_SYS. */
    uint32_t CHANGE0:1;                 /**< bit:     16  This bit is set to 1 whenever the value in Bit0 in this register changes. This bit is set to 0 whenever the 4 data bits in\n      this register are transmitted to the Host by a Slave-to-Master Virtual Wire transaction. It is also set to 0 when this entire register is\n      reset, ignoring any change in the data bit value caused by the reset event. */
    uint32_t CHANGE1:1;                 /**< bit:     17  This bit is set to 1 whenever the value in Bit1 in this register changes. This bit is set to 0 whenever the 4 data bits in\n      this register are transmitted to the Host by a Slave-to-Master Virtual Wire transaction. It is also set to 0 when this entire register is\n      reset, ignoring any change in the data bit value caused by the reset event. */
    uint32_t CHANGE2:1;                 /**< bit:     18  This bit is set to 1 whenever the value in Bit2 in this register changes. This bit is set to 0 whenever the 4 data bits in\n      this register are transmitted to the Host by a Slave-to-Master Virtual Wire transaction. It is also set to 0 when this entire register is\n      reset, ignoring any change in the data bit value caused by the reset event. */
    uint32_t CHANGE3:1;                 /**< bit:     19  This bit is set to 1 whenever the value in Bit3 in this register changes. This bit is set to 0 whenever the 4 data bits in\n      this register are transmitted to the Host by a Slave-to-Master Virtual Wire transaction. It is also set to 0 when this entire register is\n      reset, ignoring any change in the data bit value caused by the reset event. */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  {
    uint32_t :16;                       /**< bit:  0..15  Reserved                                      */
    uint32_t CHANGE:4;                  /**< bit: 16..19  This bit is set to x whenever the value in Bit3 in this register changes. This bit is set to x whenever the 4 data bits in\n      this register are transmitted to the Host by a Slave-to-Master Virtual Wire transaction. It is also set to x when this entire register is\n      reset, ignoring any change in the data bit value caused by the reset event. */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_SMVW00_1_SMVW03_DW0_bits_t;
