ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_smvw00_1.h
/* -------- ESPI_SMVW00_1_SMVW03_DW1 : (ESPI_SMVW00_1 Offset: 0x1c) (R/W 32) Slave-to-Master Virtual Wire 3 Register (DWord 1) -------- */

typedef union
{
  struct
  {
    uint32_t SRC0:1;                    /**< bit:      0  Slave-to-Master data for Bit Position 0 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t SRC1:1;                    /**< bit:      8  Slave-to-Master data for Bit Position 1 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. */
    uint32_t :7;                        /**< bit:  9..15  Reserved                                      */
    uint32_t SRC2:1;                    /**< bit:     16  Slave-to-Master data for Bit Position 2 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. */
    uint32_t :7;                        /**< bit: 17..23  Reserved                                      */
    uint32_t SRC3:1;                    /**< bit:     24  Slave-to-Master data for Bit Position 3 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  struct
  {
    uint32_t SRC:4;                     /**< bit:   0..3  Slave-to-Master data for Bit Position 3 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_SMVW00_1_SMVW03_DW1_bits_t;
#define ESPI_SMVW00_1_SMVW03_DW1_RESETVALUE (0x00U)                                       /**<  (ESPI_SMVW00_1_SMVW03_DW1) Slave-to-Master Virtual Wire 3 Register (DWord 1)  Reset Value */

#define ESPI_SMVW00_1_SMVW03_DW1_SRC0_Pos     (0)                                            /**< (ESPI_SMVW00_1_SMVW03_DW1) Slave-to-Master data for Bit Position 0 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. Position */
#define ESPI_SMVW00_1_SMVW03_DW1_SRC0_Msk     (0x1U << ESPI_SMVW00_1_SMVW03_DW1_SRC0_Pos)    /**< (ESPI_SMVW00_1_SMVW03_DW1) Slave-to-Master data for Bit Position 0 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. Mask */
#define ESPI_SMVW00_1_SMVW03_DW1_SRC1_Pos     (8)                                            /**< (ESPI_SMVW00_1_SMVW03_DW1) Slave-to-Master data for Bit Position 1 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. Position */
#define ESPI_SMVW00_1_SMVW03_DW1_SRC1_Msk     (0x1U << ESPI_SMVW00_1_SMVW03_DW1_SRC1_Pos)    /**< (ESPI_SMVW00_1_SMVW03_DW1) Slave-to-Master data for Bit Position 1 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. Mask */
#define ESPI_SMVW00_1_SMVW03_DW1_SRC2_Pos     (16)                                           /**< (ESPI_SMVW00_1_SMVW03_DW1) Slave-to-Master data for Bit Position 2 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. Position */
#define ESPI_SMVW00_1_SMVW03_DW1_SRC2_Msk     (0x1U << ESPI_SMVW00_1_SMVW03_DW1_SRC2_Pos)    /**< (ESPI_SMVW00_1_SMVW03_DW1) Slave-to-Master data for Bit Position 2 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. Mask */
#define ESPI_SMVW00_1_SMVW03_DW1_SRC3_Pos     (24)                                           /**< (ESPI_SMVW00_1_SMVW03_DW1) Slave-to-Master data for Bit Position 3 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. Position */
#define ESPI_SMVW00_1_SMVW03_DW1_SRC3_Msk     (0x1U << ESPI_SMVW00_1_SMVW03_DW1_SRC3_Pos)    /**< (ESPI_SMVW00_1_SMVW03_DW1) Slave-to-Master data for Bit Position 3 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. Mask */
#define ESPI_SMVW00_1_SMVW03_DW1_Msk          (0x01010101UL)                                 /**< (ESPI_SMVW00_1_SMVW03_DW1) Register Mask  */
#define ESPI_SMVW00_1_SMVW03_DW1_SRC_Pos      (0)                                            /**< (ESPI_SMVW00_1_SMVW03_DW1 Position) Slave-to-Master data for Bit Position 3 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction. */
#define ESPI_SMVW00_1_SMVW03_DW1_SRC_Msk      (0xFU << ESPI_SMVW00_1_SMVW03_DW1_SRC_Pos)     /**< (ESPI_SMVW00_1_SMVW03_DW1 Mask) SRC */
#define ESPI_SMVW00_1_SMVW03_DW1_SRC(value)   (ESPI_SMVW00_1_SMVW03_DW1_SRC_Msk & ((value) << ESPI_SMVW00_1_SMVW03_DW1_SRC_Pos))

