ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_smvw00_1.h
/** \brief ESPI_SMVW00_1 register offsets definitions */
#define ESPI_SMVW00_1_SMVW00_DW0_OFFSET (0x00)         /**< (ESPI_SMVW00_1_SMVW00_DW0) Slave-to-Master Virtual Wire 0 Register (DWord 0) Offset */
#define ESPI_SMVW00_1_SMVW00_DW1_OFFSET (0x04)         /**< (ESPI_SMVW00_1_SMVW00_DW1) Slave-to-Master Virtual Wire 0 Register (DWord 1) Offset */
#define ESPI_SMVW00_1_SMVW01_DW0_OFFSET (0x08)         /**< (ESPI_SMVW00_1_SMVW01_DW0) Slave-to-Master Virtual Wire 1 Register (DWord 0) Offset */
#define ESPI_SMVW00_1_SMVW01_DW1_OFFSET (0x0C)         /**< (ESPI_SMVW00_1_SMVW01_DW1) Slave-to-Master Virtual Wire 1 Register (DWord 1) Offset */
#define ESPI_SMVW00_1_SMVW02_DW0_OFFSET (0x10)         /**< (ESPI_SMVW00_1_SMVW02_DW0) Slave-to-Master Virtual Wire 2 Register (DWord 0) Offset */
#define ESPI_SMVW00_1_SMVW02_DW1_OFFSET (0x14)         /**< (ESPI_SMVW00_1_SMVW02_DW1) Slave-to-Master Virtual Wire 2 Register (DWord 1) Offset */
#define ESPI_SMVW00_1_SMVW03_DW0_OFFSET (0x18)         /**< (ESPI_SMVW00_1_SMVW03_DW0) Slave-to-Master Virtual Wire 3 Register (DWord 0) Offset */
#define ESPI_SMVW00_1_SMVW03_DW1_OFFSET (0x1C)         /**< (ESPI_SMVW00_1_SMVW03_DW1) Slave-to-Master Virtual Wire 3 Register (DWord 1) Offset */
#define ESPI_SMVW00_1_SMVW04_DW0_OFFSET (0x20)         /**< (ESPI_SMVW00_1_SMVW04_DW0) Slave-to-Master Virtual Wire 4 Register (DWord 0) Offset */
#define ESPI_SMVW00_1_SMVW04_DW1_OFFSET (0x24)         /**< (ESPI_SMVW00_1_SMVW04_DW1) Slave-to-Master Virtual Wire 4 Register (DWord 1) Offset */
#define ESPI_SMVW00_1_SMVW05_DW0_OFFSET (0x28)         /**< (ESPI_SMVW00_1_SMVW05_DW0) Slave-to-Master Virtual Wire 5 Register (DWord 0) Offset */
#define ESPI_SMVW00_1_SMVW05_DW1_OFFSET (0x2C)         /**< (ESPI_SMVW00_1_SMVW05_DW1) Slave-to-Master Virtual Wire 5 Register (DWord 1) Offset */
#define ESPI_SMVW00_1_SMVW06_DW0_OFFSET (0x30)         /**< (ESPI_SMVW00_1_SMVW06_DW0) Slave-to-Master Virtual Wire 6 Register (DWord 0) Offset */
#define ESPI_SMVW00_1_SMVW06_DW1_OFFSET (0x34)         /**< (ESPI_SMVW00_1_SMVW06_DW1) Slave-to-Master Virtual Wire 6 Register (DWord 1) Offset */
#define ESPI_SMVW00_1_SMVW07_DW0_OFFSET (0x38)         /**< (ESPI_SMVW00_1_SMVW07_DW0) Slave-to-Master Virtual Wire 7 Register (DWord 0) Offset */
#define ESPI_SMVW00_1_SMVW07_DW1_OFFSET (0x3C)         /**< (ESPI_SMVW00_1_SMVW07_DW1) Slave-to-Master Virtual Wire 7 Register (DWord 1) Offset */
#define ESPI_SMVW00_1_SMVW08_DW0_OFFSET (0x40)         /**< (ESPI_SMVW00_1_SMVW08_DW0) Slave-to-Master Virtual Wire 8 Register (DWord 0) Offset */
#define ESPI_SMVW00_1_SMVW08_DW1_OFFSET (0x44)         /**< (ESPI_SMVW00_1_SMVW08_DW1) Slave-to-Master Virtual Wire 8 Register (DWord 1) Offset */
#define ESPI_SMVW00_1_SMVW09_DW0_OFFSET (0x48)         /**< (ESPI_SMVW00_1_SMVW09_DW0) Slave-to-Master Virtual Wire 9 Register (DWord 0) Offset */
#define ESPI_SMVW00_1_SMVW09_DW1_OFFSET (0x4C)         /**< (ESPI_SMVW00_1_SMVW09_DW1) Slave-to-Master Virtual Wire 9 Register (DWord 1) Offset */
#define ESPI_SMVW00_1_SMVW10_DW0_OFFSET (0x50)         /**< (ESPI_SMVW00_1_SMVW10_DW0) Slave-to-Master Virtual Wire 10 Register (DWord 0) Offset */
#define ESPI_SMVW00_1_SMVW10_DW1_OFFSET (0x54)         /**< (ESPI_SMVW00_1_SMVW10_DW1) Slave-to-Master Virtual Wire 10 Register (DWord 1) Offset */

/** \brief ESPI_SMVW00_1 register API structure */
typedef struct
{  /* The Virtual Wire Channel permits the System to emulate a set of wires that interconnect the system Core Logic with the EC. */
  __IO  __ESPI_SMVW00_1_SMVW00_DW0_bits_t SMVW00_DW0;    /**< Offset: 0x00 (R/W  32) Slave-to-Master Virtual Wire 0 Register (DWord 0) */
  __IO  __ESPI_SMVW00_1_SMVW00_DW1_bits_t SMVW00_DW1;    /**< Offset: 0x04 (R/W  32) Slave-to-Master Virtual Wire 0 Register (DWord 1) */
  __IO  __ESPI_SMVW00_1_SMVW01_DW0_bits_t SMVW01_DW0;    /**< Offset: 0x08 (R/W  32) Slave-to-Master Virtual Wire 1 Register (DWord 0) */
  __IO  __ESPI_SMVW00_1_SMVW01_DW1_bits_t SMVW01_DW1;    /**< Offset: 0x0C (R/W  32) Slave-to-Master Virtual Wire 1 Register (DWord 1) */
  __IO  __ESPI_SMVW00_1_SMVW02_DW0_bits_t SMVW02_DW0;    /**< Offset: 0x10 (R/W  32) Slave-to-Master Virtual Wire 2 Register (DWord 0) */
  __IO  __ESPI_SMVW00_1_SMVW02_DW1_bits_t SMVW02_DW1;    /**< Offset: 0x14 (R/W  32) Slave-to-Master Virtual Wire 2 Register (DWord 1) */
  __IO  __ESPI_SMVW00_1_SMVW03_DW0_bits_t SMVW03_DW0;    /**< Offset: 0x18 (R/W  32) Slave-to-Master Virtual Wire 3 Register (DWord 0) */
  __IO  __ESPI_SMVW00_1_SMVW03_DW1_bits_t SMVW03_DW1;    /**< Offset: 0x1C (R/W  32) Slave-to-Master Virtual Wire 3 Register (DWord 1) */
  __IO  __ESPI_SMVW00_1_SMVW04_DW0_bits_t SMVW04_DW0;    /**< Offset: 0x20 (R/W  32) Slave-to-Master Virtual Wire 4 Register (DWord 0) */
  __IO  __ESPI_SMVW00_1_SMVW04_DW1_bits_t SMVW04_DW1;    /**< Offset: 0x24 (R/W  32) Slave-to-Master Virtual Wire 4 Register (DWord 1) */
  __IO  __ESPI_SMVW00_1_SMVW05_DW0_bits_t SMVW05_DW0;    /**< Offset: 0x28 (R/W  32) Slave-to-Master Virtual Wire 5 Register (DWord 0) */
  __IO  __ESPI_SMVW00_1_SMVW05_DW1_bits_t SMVW05_DW1;    /**< Offset: 0x2C (R/W  32) Slave-to-Master Virtual Wire 5 Register (DWord 1) */
  __IO  __ESPI_SMVW00_1_SMVW06_DW0_bits_t SMVW06_DW0;    /**< Offset: 0x30 (R/W  32) Slave-to-Master Virtual Wire 6 Register (DWord 0) */
  __IO  __ESPI_SMVW00_1_SMVW06_DW1_bits_t SMVW06_DW1;    /**< Offset: 0x34 (R/W  32) Slave-to-Master Virtual Wire 6 Register (DWord 1) */
  __IO  __ESPI_SMVW00_1_SMVW07_DW0_bits_t SMVW07_DW0;    /**< Offset: 0x38 (R/W  32) Slave-to-Master Virtual Wire 7 Register (DWord 0) */
  __IO  __ESPI_SMVW00_1_SMVW07_DW1_bits_t SMVW07_DW1;    /**< Offset: 0x3C (R/W  32) Slave-to-Master Virtual Wire 7 Register (DWord 1) */
  __IO  __ESPI_SMVW00_1_SMVW08_DW0_bits_t SMVW08_DW0;    /**< Offset: 0x40 (R/W  32) Slave-to-Master Virtual Wire 8 Register (DWord 0) */
  __IO  __ESPI_SMVW00_1_SMVW08_DW1_bits_t SMVW08_DW1;    /**< Offset: 0x44 (R/W  32) Slave-to-Master Virtual Wire 8 Register (DWord 1) */
  __IO  __ESPI_SMVW00_1_SMVW09_DW0_bits_t SMVW09_DW0;    /**< Offset: 0x48 (R/W  32) Slave-to-Master Virtual Wire 9 Register (DWord 0) */
  __IO  __ESPI_SMVW00_1_SMVW09_DW1_bits_t SMVW09_DW1;    /**< Offset: 0x4C (R/W  32) Slave-to-Master Virtual Wire 9 Register (DWord 1) */
  __IO  __ESPI_SMVW00_1_SMVW10_DW0_bits_t SMVW10_DW0;    /**< Offset: 0x50 (R/W  32) Slave-to-Master Virtual Wire 10 Register (DWord 0) */
  __IO  __ESPI_SMVW00_1_SMVW10_DW1_bits_t SMVW10_DW1;    /**< Offset: 0x54 (R/W  32) Slave-to-Master Virtual Wire 10 Register (DWord 1) */
} espismvw001_registers_t;
/** @}  end of The Virtual Wire Channel permits the System to emulate a set of wires that interconnect the system Core Logic with the EC. */

#endif /* _PIC32CX_0525SG12_ESPI_SMVW00_1_COMPONENT_H_ */
